# TableCellCalculatedValueData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellCalculatedValueData Class
Members See Also
---
The TableCellCalculatedValueData stores the data for calculated value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TableCellCalculatedValueData : IDisposable
```

Visual Basic
---
```text
Public Class TableCellCalculatedValueData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TableCellCalculatedValueData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TableCellCalculatedValueData
# See Also
TableCellCalculatedValueData Members
Autodesk.Revit.DB Namespace